app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT `pages`.* FROM `pages`

  def edit
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1