app/controllers/signatories_controller.rb

  def index
    @signatories = Signatory.all
---
SELECT `signatories`.* FROM `signatories`

  def show
    @signatory = Signatory.find(params[:id])
---
SELECT `signatories`.* FROM `signatories` WHERE `signatories`.`id` = 1 LIMIT 1

  def edit
    @signatory = Signatory.find(params[:id])
---
SELECT `signatories`.* FROM `signatories` WHERE `signatories`.`id` = 1 LIMIT 1

  def create
    @signatory = Signatory.new(params[:signatory])

    respond_to do |format|
      if @signatory.save
---
INSERT INTO `signatories` (`affiliation`, `created_at`, `email`, `fname`, `lname`, `message`, `student_id`, `updated_at`) VALUES ('UNDERGRAD', '2012-04-02 10:36:58', 'Test@test.com', 'Test', 'Test', 'Some Message', 's1234567', '2012-04-02 10:36:58')

  def update
    @signatory = Signatory.find(params[:id])

    respond_to do |format|
      if @signatory.update_attributes(params[:signatory])
---
SELECT `signatories`.* FROM `signatories` WHERE `signatories`.`id` = 2 LIMIT 1
UPDATE `signatories` SET `affiliation` = 'postgrad', `updated_at` = '2012-04-02 12:22:12' WHERE `signatories`.`id` = 2